README.org
:properties:
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-bigblow.setup
#+OPTIONS: num:nil
#+EXPORT_FILE_NAME: index.html
:end:
#+title: Operational Geometry
* Objectives
One of my main flaws is that I am interested in far too many topics than I can possibly explore in my lifetime. This website is my attempt to maintain a history of what I have learned, showcase the projects that I have implemented, and outline my goals for the future. I hope that any visitor to this website will understand how I can help you based on the unique set of experiences and skills I have accumulated.
* Work Experience
** Sandia National Laboratories
*** W80-4/B61-12 JTA Systems Engineer
- Developed automation code with Kubernetes to orchestrate deployment of Docker-containerized proprietary applications for distributed telemetry data collection and processing on High Performance Computing pipelines

*** Radar ISR Software Development Engineer
- Developed optimized Matlab data processing Matlab package improving the production and delivery of Synthetic Aperture Radar (SAR) products to government customers
- Designed and implemented robust UI utilizing Google Earth to model radar geometries of interest, currently being utilized as both a visual debugger and to showcase mission examples to customers and management
- Generalized and modularized 3D visualization code to accomodate multimode radar data, enhancing organizations Mod/Sim capabilities
** Ascendion
*** Machine Learning Research Intern

* Education
** UC Berkeley Coursework
*** Machine Learning
*** Data Structures and Algorithms
**** Efficient Algorithms and Intractable Problems
**** Geometric Algorithms
see: [[https://ocw.mit.edu/courses/18-409-topics-in-theoretical-computer-science-an-algorithmists-toolkit-fall-2009/pages/syllabus/]]
*** Cybersecurity
*** Probability Theory and Stochastic Processes
*** Linear Algebra
*** Nanorobotics
** Self Study
*** Differential Equations
*** Differential Geometry
*** Computational Compressible Fluid Dynamics
*** Geometric Control Theory
* Interests
+ Quantitative Finance
+ Machine Learning/AI
+ Nuclear & Hypersonic System
+ Human Augmentation
+ C4ISR
  
* TODO Projects

* Skills
** Programming Languages
+ Matlab
+ Python
+ Java
+ C
+ C++ (in progress)
+ Go (in progress)
** Frameworks/Architectures
+ Git & CI/CD
+ Docker
+ Kubernetes
** Misc
+ Agile, Scrum, Kanban
+ RTL-SDR hardware and operation (SIGINT)
